{
	"@metadata": {
		"authors": [
			"Athena in Wonderland",
			"Banjo",
			"Elisardojm",
			"Toliño"
		]
	},
	"apierror-readinglists-project-title-param": "<var>$1project</var> e <var>$1title</var> deben utilizarse xuntos.",
	"apierror-readinglists-too-old": "Os selos de tempo pasados a <var>$1changedsince</var> non poden ser anteriores a <kbd>$2</kbd>.",
	"apierror-readinglists-invalidsort-notbyname": "A opción de ordenación <kbd>name</kbd> non pode usarse xunto con <var>$1changedsince</var>.",
	"apierror-readinglists-batch-invalid-json": "JSON non válido para o parámetro <var>batch</var>: $1",
	"apierror-readinglists-batch-invalid-structure": "Entrada non válida para o parámetro <var>batch</var>: debe conter unha matriz de obxectos con valores escalares.",
	"apierror-readinglists-batch-toomanyvalues": "Entrada non válida para o parámetro <var>batch</var>: demasiadas entradas, o máximo permitido é de $1",
	"apierror-readinglists-batch-missingparam-at-least-one-of": "En cada obxecto dentro da entrada <var>batch</var>, {{PLURAL:$2|o campo|polo menos un dos campos}} $1 é obrigatorio.",
	"apihelp-query+readinglists-summary": "Listar ou filtrar as listas de lectura do usuario e amosar metadatos sobre elas.",
	"apihelp-query+readinglists-extended-description": "Este módulo ten catro modos de funcionamento. Co parámetro <var>$1list</var> devolve información sobre a lista especificada. Co parámetro <var>$1changedsince</var> devolve todas as listas do usuario actual que se modificaron desde a data indicada. (Isto está pensado para a sincronización de dispositivos e, a diferenza dos outros modos, inclúe as listas eliminadas. Só se consideran os cambios nos metadatos da lista, non os cambios nos elementos da lista.) Cos parámetros <var>$1project</var> e <var>$1title</var> devolve todas as listas que inclúen esa páxina. Sen ningún deses parámetros devolve todas as listas.",
	"apihelp-query+readinglists-param-list": "Identificador da lista.",
	"apihelp-query+readinglists-param-changedsince": "Amosa as listas que se modificaron desde este selo de tempo. Debe ser posterior a <kbd>$1</kbd>. Os clientes deben utilizar o selo de tempo devolto no campo <samp>readinglists-synctimestamp</samp> dunha chamada anterior se queren asegurarse de que non se perdan ningún cambio e deben estar preparados para recibir os cambios que xa foron devoltos nunha resposta anterior e tratalos dun xeito idempotente.",
	"apihelp-query+readinglists-param-project": "Proxecto da páxina a filtrar. Debe usarse xunto con <var>$1title</var>. Só devolverá listas que inclúan este proxecto e título.",
	"apihelp-query+readinglists-param-title": "Título da páxina a filtrar. Debe usarse xunto con <var>$1project</var>. Só devolverá listas que inclúan este proxecto e título.",
	"apihelp-query+readinglists-param-sort": "Propiedade para ordenar. Ignórase cando se definen <var>$1project</var> e <var>$1title</var> (os resultados devólvense segundo a orde na base de datos). O valor predeterminado é <kbd>updated</kbd> cando se define <var>$1changedsince</var>; noutro caso, o valor é <kbd>name</kbd>.",
	"apihelp-query+readinglists-paramvalue-sort-name": "Nome da lista. (A ordenación é polo valor binario; por exemplo, calquera carácter ASCII en maiúscula irá antes que calquera carácter en minúscula.)",
	"apihelp-query+readinglists-paramvalue-sort-updated": "Selo de tempo da última actualización. (As actualizacións inclúen cambios nos metadatos da lista, pero non nos elementos da lista.)",
	"apihelp-query+readinglists-param-dir": "Dirección de ordenación: <kbd>ascending</kbd> (do A ao Z, do máis antigo ao máis recente) ou <kbd>descending</kbd>. Ignórase cando se definen <var>$1project</var> e <var>$1title</var>.",
	"apihelp-query+readinglists-param-limit": "Número de resultados a devolver.",
	"apihelp-query+readinglists-example-1": "Obter as listas de lectura do usuario actual.",
	"apihelp-query+readinglists-example-2": "Obter as listas de lectura do usuario actual que cambiaron desde <kbd>2013-01-01T00:00:00Z</kbd>.",
	"apihelp-query+readinglists-example-3": "Obter as listas de lectura do usuario actual que conteñen a páxina <kbd>Dog</kbd> do proxecto <kbd>en.wikipedia.org</kbd>",
	"apihelp-query+readinglistentries-summary": "Listar as páxinas dunha lista dada.",
	"apihelp-query+readinglistentries-extended-description": "Este módulo ten dous modos de funcionamento. Co parámetro <var>$1lists</var> devolve as páxinas da(s) lista(s) indicada(s). Co parámetro <var>$1changedsince</var> devolve todas as entradas de lista de calquera lista do usuario actual que cambiaron desde a data indicada. (Isto está pensado para a sincronización de dispositivos e, a diferenza dos outros modos, inclúe as entradas eliminadas, mais non inclúe as entradas das listas eliminadas.)",
	"apihelp-query+readinglistentries-param-lists": "Os identificadores das listas para os que devolver páxinas.",
	"apihelp-query+readinglistentries-param-changedsince": "Amosa as entradas da lista que se modificaron desde este selo de tempo. Debe ser posterior a <kbd>$1</kbd>.",
	"apihelp-query+readinglistentries-param-sort": "Propiedade para ordenar. <kbd>name</kbd> non se pode utilizar xunto con <var>$1changedsince</var>. O valor predeterminado é <kbd>updated</kbd> cando se define <var>$1changedsince</var>; noutro caso, o valor é <kbd>name</kbd>.",
	"apihelp-query+readinglistentries-paramvalue-sort-name": "Título do artigo. (Ignórase o nome do proxecto. A ordenación é polo valor binario; por exemplo, calquera carácter ASCII en maiúscula irá antes que calquera carácter en minúscula.)",
	"apihelp-query+readinglistentries-paramvalue-sort-updated": "Selo de tempo da última actualización.",
	"apihelp-query+readinglistentries-param-dir": "Dirección de ordenación: <kbd>ascending</kbd> (do A ao Z, do máis antigo ao máis recente) ou <kbd>descending</kbd>.",
	"apihelp-query+readinglistentries-param-limit": "Número de resultados a devolver.",
	"apihelp-query+readinglistentries-example-1": "Obter as páxinas das listas de lectura cos identificadores <kbd>10</kbd>, <kbd>11</kbd> e <kbd>12</kbd>.",
	"apihelp-query+readinglistentries-example-2": "Obter as entradas da lista do usuario actual que cambiaron desde <kbd>2013-01-01T00:00:00Z</kbd>.",
	"apihelp-readinglists-summary": "Operacións de escritura das listas de lectura.",
	"apihelp-readinglists-param-command": "Comando (submódulo da API) para operacións de escritura das listas de lectura.",
	"apihelp-readinglists-extended-description": "Crear, actualizar, eliminar, ordenar listas de lectura e entradas. Consulta a documentación dos distintos comandos para obter máis información.",
	"apihelp-readinglists+setup-summary": "Activar as listas para o usuario actual.",
	"apihelp-readinglists+setup-extended-description": "Este comando debe utilizarse antes de que o usuario poida facer calquera outra cousa coas listas de lectura. Tamén crea unha lista predeterminada. Para desfacelo, utiliza o comando <kbd>[[Special:ApiHelp/readinglists+teardown|teardown]]</kbd>.",
	"apihelp-readinglists+setup-example-1": "Instalar as listas de lectura para o usuario actual.",
	"apihelp-readinglists+teardown-summary": "Desactivar as listas para o usuario actual.",
	"apihelp-readinglists+teardown-extended-description": "Elimina todos os datos das listas de lectura do usuario. O comando <kbd>[[Special:ApiHelp/readinglists+setup|setup]]</kbd> debe utilizarse se o usuario quere comezar a usar listas de lectura de novo.",
	"apihelp-readinglists+teardown-example-1": "Desactivar as listas de lectura para o usuario actual.",
	"apihelp-readinglists+create-summary": "Crear unha nova lista para o usuario actual.",
	"apihelp-readinglists+create-extended-description": "O usuario debe ter menos de $1 {{PLURAL:$1|lista (non eliminada)|listas (non eliminadas)}}.",
	"apihelp-readinglists+create-param-name": "Nome da lista. Obrigatorio a menos que esteas utilizando unha creación por lotes.",
	"apihelp-readinglists+create-param-description": "Descrición da lista.",
	"apihelp-readinglists+create-param-batch": "Datos por lotes para crear varias listas nunha única solicitude, en forma de matriz JSON cun ou máis obxectos cos campos <var>name</var> e (opcionalmente) <var>description</var>.",
	"apihelp-readinglists+create-example-1": "Crear unha lista de lectura nova.",
	"apihelp-readinglists+create-example-2": "Crear varias listas novas.",
	"apihelp-readinglists+update-summary": "Actualizar unha lista pertencente ó usuario actual.",
	"apihelp-readinglists+update-param-list": "Identificador da lista. Obrigatorio a menos que esteas utilizando unha actualización por lotes.",
	"apihelp-readinglists+update-param-name": "Nome novo da lista. É obrigatorio indicar isto ou a descripción, a menos que esteas a facer unha actualización por lotes.",
	"apihelp-readinglists+update-param-description": "Descrición nova da lista.",
	"apihelp-readinglists+update-param-batch": "Datos por lotes para actualizar varias listas nunha única solicitude, en forma de matriz JSON cun ou máis obxectos cos campos <var>list</var>, <var>name</var> e <var>description</var>. O nome e a descrición son opcionais, pero polo menos un deles debe estar presente.",
	"apihelp-readinglists+update-example-1": "Cambiar o nome da lista de lectura co identificador <kbd>42</kbd>.",
	"apihelp-readinglists+update-example-2": "Actualizar varias listas.",
	"apihelp-readinglists+delete-summary": "Eliminar unha lista pertencente ó usuario actual.",
	"apihelp-readinglists+delete-extended-description": "As listas eliminadas permanecen dispoñibles durante algún tempo a través dos módulos <kbd>[[Special:ApiHelp/query+readinglists|readinglists]]</kbd> e <kbd>[[Special:ApiHelp/query+readinglistentries|readinglistentries]]</kbd> (mediante o parámetro <var>$1changedsince</var>). Non hai forma de recuperar a eliminación.",
	"apihelp-readinglists+delete-param-list": "Identificador da lista. Obrigatorio a menos que esteas a facer unha eliminación por lotes.",
	"apihelp-readinglists+delete-param-batch": "Datos por lotes para borrar varias listas nunha única solicitude, en forma de matriz JSON cun ou máis obxectos co campo <var>list</var>.",
	"apihelp-readinglists+delete-example-1": "Borrar a lista de lectura co identificador <kbd>11</kbd>.",
	"apihelp-readinglists+delete-example-2": "Eliminar varias listas.",
	"apihelp-readinglists+createentry-summary": "Engadir unha páxina nova a unha lista pertencente ó usuario actual.",
	"apihelp-readinglists+createentry-extended-description": "As entradas da lista deben ser únicas. As páxinas non se limitan ao wiki desde onde se accede á API. O usuario debe ter menos de $1 {{PLURAL:$1|entrada (non eliminada)|entradas (non eliminadas)}} na lista.",
	"apihelp-readinglists+createentry-param-list": "Identificador da lista.",
	"apihelp-readinglists+createentry-param-project": "Nome do proxecto do wiki que aloxa a páxina. (Normalmente, isto é o nome de dominio do wiki.) Obrigatorio a menos que esteas a facer unha creación por lotes.",
	"apihelp-readinglists+createentry-param-title": "Título da páxina.",
	"apihelp-readinglists+createentry-param-batch": "Datos por lotes para crear varias entradas de lista (na mesma lista) nunha única solicitude, en forma de matriz JSON cun ou máis obxectos cos campos <var>project</var> e <var>title</var>.",
	"apihelp-readinglists+createentry-example-1": "Engadir a páxina <kbd>Dog</kbd> do proxecto <kbd>en.wikipedia.org</kbd> á lista co identificador <kbd>33</kbd>.",
	"apihelp-readinglists+createentry-example-2": "Engadir varias páxinas a unha lista.",
	"apihelp-readinglists+deleteentry-summary": "Eliminar unha páxina dunha lista pertencente ó usuario actual.",
	"apihelp-readinglists+deleteentry-param-entry": "Identificador da entrada. Obrigatorio a menos que esteas a facer unha eliminación por lotes.",
	"apihelp-readinglists+deleteentry-param-batch": "Datos por lotes para borrar varias entradas de listas nunha única solicitude, en forma de matriz JSON cun ou máis obxectos co campo <var>entry</var>.",
	"apihelp-readinglists+deleteentry-example-1": "Eliminar a entrada de lista que ten o identificador <kbd>8</kbd>.",
	"apihelp-readinglists+deleteentry-example-2": "Eliminar varias entradas de lista."
}
