{
	"@metadata": {
		"authors": [
			"McDutchie"
		]
	},
	"apierror-readinglists-project-title-param": "<var>$1project</var> e <var>$1title</var> debe esser usate insimul.",
	"apierror-readinglists-too-old": "Datas e horas passate a <var>$1changedsince</var> non pote esser anterior a <kbd>$2</kbd>.",
	"apierror-readinglists-invalidsort-notbyname": "Le option de ordinamento <kbd>name</kbd> non pote esser usate insimul con <var>$1changedsince</var>.",
	"apierror-readinglists-batch-invalid-json": "JSON non valide pro le parametro <var>batch</var>: $1",
	"apierror-readinglists-batch-invalid-structure": "Entrata non valide pro le parametro <var>batch</var>: debe continer un matrice de objectos con valores scalar.",
	"apierror-readinglists-batch-toomanyvalues": "Entrata non valide pro le parametro <var>batch</var>: troppo de elementos, le maximo autorisate es $1",
	"apierror-readinglists-batch-missingparam-at-least-one-of": "In cata objecto in le entrata <var>batch</var>, {{PLURAL:$2|le campo|al minus un del campos}} $1 es necessari.",
	"apihelp-query+readinglists-summary": "Listar o filtrar le listas de lectura del usator e monstrar metadatos sur illos.",
	"apihelp-query+readinglists-extended-description": "Iste modulo ha quatro modos de operation. Con le parametro <var>$1list</var>, restitue information sur le lista specificate. Con le parametro <var>$1changedsince</var>, restitue tote le listas del usator actual que ha cambiate depost le data fornite. (Isto servi al synchronisation de apparatos e, contrarimente al altere modos, include le listas delite. Solmente le cambiamentos de metadatos de listas es considerate, non cambiamentos de elementos de listas.) Con le parametros <var>$1project</var> e <var>$1title</var>, restitue tote le listas que include iste pagina. Sin alcun de iste parametros, restitue tote le listas.",
	"apihelp-query+readinglists-param-list": "ID del lista.",
	"apihelp-query+readinglists-param-changedsince": "Monstra listas que ha cambiate depost iste data e hora. Debe esser posterior a <kbd>$1</kbd>. Clientes deberea usar le data e hora restituite in le campo <samp>readinglists-synctimestamp</samp> de un appello anterior si se vole assecurar que nulle cambiamento manca, e debe esser preparate de reciper cambiamentos que ha jam essite restituite in un responsa anterior, e de manear los de un maniera idempotente.",
	"apihelp-query+readinglists-param-project": "Projecto del pagina sur le qual filtrar. Debe esser usate insimul con <var>$1title</var>. Restitue solmente listas que include iste projecto e titulo.",
	"apihelp-query+readinglists-param-title": "Titulo del pagina sur le qual filtrar. Debe esser usate insimul con <var>$1project</var>. Restitue solmente listas que include iste projecto e titulo.",
	"apihelp-query+readinglists-param-sort": "Proprietate per le qual ordinar. Ignorate si <var>$1project</var> e <var>$1title</var> es definite (le resultatos se restitue in le ordine del base de datos). Le valor predefinite es <kbd>updated</kbd> si <var>$1changedsince</var> es definite, e <kbd>name</kbd> alteremente.",
	"apihelp-query+readinglists-paramvalue-sort-name": "Nomine del lista. (Le ordinamento se face per valor binari, p.ex. un majuscula in ASCII se ordina ante qualcunque minuscula.)",
	"apihelp-query+readinglists-paramvalue-sort-updated": "Data e hora del ultime actualisation. (Le actualisationes include le cambiamentos de metadatos de lista ma non le cambiamentos de elementos de lista.)",
	"apihelp-query+readinglists-param-dir": "Direction de ordinamento: <kbd>ascending</kbd> (de A a Z, del plus ancian al plus recente) o <kbd>descending</kbd>. Ignorate si <var>$1project</var> e <var>$1title</var> es definite.",
	"apihelp-query+readinglists-param-limit": "Numero de elementos resultante a restituer.",
	"apihelp-query+readinglists-example-1": "Obtener le listas de lectura del usator actual.",
	"apihelp-query+readinglists-example-2": "Obtener le listas de lectura del usator actual que ha cambiate depost <kbd>2013-01-01T00:00:00Z</kbd>.",
	"apihelp-query+readinglists-example-3": "Obtener le listas de lectura del usator actual que contine le pagina <kbd>Dog</kbd> del projecto <kbd>en.wikipedia.org</kbd>",
	"apihelp-query+readinglistentries-summary": "Listar le paginas de un certe lista.",
	"apihelp-query+readinglistentries-extended-description": "Iste modulo ha duo modos de operation. Con le parametro <var>$1lists</var>, restitue le paginas in le lista(s) fornite. Con le parametro <var>$1changedsince</var>, restitue tote le entratas de qualcunque lista del usator actual que ha cambiate depost le data fornite. (Isto servi al synchronisation de apparatos e, contrarimente al altere modos, include entratas delite, ma non entratas de lista delite.)",
	"apihelp-query+readinglistentries-param-lists": "Le IDs del listas pro le quales restituer paginas.",
	"apihelp-query+readinglistentries-param-changedsince": "Monstrar entratas de lista que ha cambiate depost iste data e hora. Debe esser posterior a <kbd>$1</kbd>.",
	"apihelp-query+readinglistentries-param-sort": "Proprietate secundo le qual ordinar. <var>name</var> non pote esser usate insimul con <kbd>$1changedsince</kbd>. Le valor predefinite es <kbd>updated</kbd> si <var>$1changedsince</var> es definite, e <kbd>name</kbd> alteremente.",
	"apihelp-query+readinglistentries-paramvalue-sort-name": "Titulo del articulo. (Le nomine del projecto es ignorate. Le ordinamento se face per valor binari, p.ex. un majuscula in ASCII se ordina ante qualcunque minuscula.)",
	"apihelp-query+readinglistentries-paramvalue-sort-updated": "Data e hora del ultime actualisation.",
	"apihelp-query+readinglistentries-param-dir": "Direction de ordinamento: <kbd>ascending</kbd> (de A a Z, del plus ancian al plus recente) o <kbd>descending</kbd>.",
	"apihelp-query+readinglistentries-param-limit": "Numero de elementos resultante a restituer.",
	"apihelp-query+readinglistentries-example-1": "Obtener le paginas del listas de lectura con ID <kbd>10</kbd>, <kbd>11</kbd> e <kbd>12</kbd>.",
	"apihelp-query+readinglistentries-example-2": "Obtener le entratas de lista del usator actual que ha cambiate depost <kbd>2013-01-01T00:00:00Z</kbd>.",
	"apihelp-readinglists-summary": "Operationes de scriptura de listas de lectura.",
	"apihelp-readinglists-param-command": "Commando (submodulo del API) pro operationes de scriptura de listas de lectura.",
	"apihelp-readinglists-extended-description": "Crear/actualisar/deler/ordinar listas de lectura e lor entratas. Vide le documentation del varie commandos pro detalios.",
	"apihelp-readinglists+setup-summary": "Activar listas pro le usator actual.",
	"apihelp-readinglists+setup-extended-description": "Iste commando debe esser usate ante que le usator pote facer qualcosa altere con listas de lectura. Tamben crea un lista predefinite. Pro disfacer lo, usa <kbd>[[Special:ApiHelp/readinglists+teardown|teardown]]</kbd>.",
	"apihelp-readinglists+setup-example-1": "Installar listas de lectura del usator actual.",
	"apihelp-readinglists+teardown-summary": "Disactivar listas pro le usator actual.",
	"apihelp-readinglists+teardown-extended-description": "Remove tote le datos de listas de lectura pro le usator. Le commando <kbd>[[Special:ApiHelp/readinglists+setup|setup]]</kbd> debe esser usate si le usator vole recomenciar a usar listas de lectura.",
	"apihelp-readinglists+teardown-example-1": "Disactivar listas de lectura pro le usator actual.",
	"apihelp-readinglists+create-summary": "Crear un nove lista pro le usator actual.",
	"apihelp-readinglists+create-extended-description": "Le usator debe haber minus de $1 lista{{PLURAL:$1||s}} (non delite).",
	"apihelp-readinglists+create-param-name": "Nomine del lista. Obligatori excepte pro le creation per lotes.",
	"apihelp-readinglists+create-param-description": "Description del lista.",
	"apihelp-readinglists+create-param-batch": "Datos de lot pro crear plure listas in un sol requesta, in le forma de un matrice JSON con un o plus objectos con campos <var>name</var> e (optionalmente) <var>description</var>.",
	"apihelp-readinglists+create-example-1": "Crear un nove lista de lectura.",
	"apihelp-readinglists+create-example-2": "Crear plure nove listas.",
	"apihelp-readinglists+update-summary": "Actualisar un lista que pertine al usator actual.",
	"apihelp-readinglists+update-param-list": "ID del lista. Obligatori excepte pro le creation per lotes.",
	"apihelp-readinglists+update-param-name": "Le nove nomine del lista. O iste, o le description es obligatori excepte pro le actualisation per lotes.",
	"apihelp-readinglists+update-param-description": "Le nove description del lista.",
	"apihelp-readinglists+update-param-batch": "Datos de lot pro actualisar plure listas in un sol requesta, in le forma de un matrice JSON con un o plus objectos con campos <var>list</var> (lista), <var>name</var> (nomine) e <var>description</var>. Le nomine e description es optional ma al minus un de illos debe esser presente.",
	"apihelp-readinglists+update-example-1": "Cambiar le nomine del lista de lectura con ID <kbd>42</kbd>.",
	"apihelp-readinglists+update-example-2": "Actualisar plure listas.",
	"apihelp-readinglists+delete-summary": "Deler un lista que pertine al usator actual.",
	"apihelp-readinglists+delete-extended-description": "Le listas delite remane disponibile pro un certe periodo de tempore per le modulos <kbd>[[Special:ApiHelp/query+readinglists|readinglists]]</kbd> e <kbd>[[Special:ApiHelp/query+readinglistentries|readinglistentries]]</kbd> (a transverso le parametro <var>$1changedsince</var>). Non es possibile disfacer le deletion.",
	"apihelp-readinglists+delete-param-list": "ID del lista. Obligatori excepte pro le deletion per lotes.",
	"apihelp-readinglists+delete-param-batch": "Datos de lot pro deler plure listas in un sol requesta, in le forma de un matrice JSON con un o plus objectos con un campo <var>list</var>.",
	"apihelp-readinglists+delete-example-1": "Deler le lista de lectura con ID <kbd>11</kbd>.",
	"apihelp-readinglists+delete-example-2": "Deler plure listas.",
	"apihelp-readinglists+createentry-summary": "Adder un nove pagina a un lista que pertine al usator actual.",
	"apihelp-readinglists+createentry-extended-description": "Le entratas de lista debe esser unic. Le paginas non es limitate al wiki ubi se accede al API. Le usator debe haber minus de $1 entrata{{PLURAL:$1||s}} (non delite) in le lista.",
	"apihelp-readinglists+createentry-param-list": "ID del lista.",
	"apihelp-readinglists+createentry-param-project": "Nomine de projecto del wiki que alberga le pagina. (Typicamente isto es le nomine de dominio del wiki.) Obligatori excepte pro le creation per lotes.",
	"apihelp-readinglists+createentry-param-title": "Le titulo del pagina (incluse le nomine localisate del spatio de nomines). Obligatori excepte pro le creation per lotes. Un formato legibile per humanos (spatios, non tractos de sublineamento) es recommendate. Le API tracta titulos como catenas de texto crude; le normalisation (como le uso de majusculas) es lassate al clientes.",
	"apihelp-readinglists+createentry-param-batch": "Datos de lot pro crear plure entratas de lista (in le mesme lista) in un sol requesta, in le forma de un matrice JSON con un o plus objectos con campos <var>project</var> e <var>title</var>.",
	"apihelp-readinglists+createentry-example-1": "Adder le pagina <kbd>Dog</kbd> del projecto <kbd>en.wikipedia.org</kbd> al lista con ID <kbd>33</kbd>.",
	"apihelp-readinglists+createentry-example-2": "Adder plure paginas a un lista.",
	"apihelp-readinglists+deleteentry-summary": "Deler un pagina de un lista que pertine al usator actual.",
	"apihelp-readinglists+deleteentry-param-entry": "ID del entrata. Obligatori excepte pro le deletion per lotes.",
	"apihelp-readinglists+deleteentry-param-batch": "Datos de lot pro deler plure entratas de lista in un sol requesta, in le forma de un matrice JSON con un o plus objectos con un campo <var>entry</var>.",
	"apihelp-readinglists+deleteentry-example-1": "Deler le entrata de lista con ID <kbd>8</kbd>.",
	"apihelp-readinglists+deleteentry-example-2": "Deler plure entratas de lista."
}
