{
	"@metadata": {
		"authors": [
			"Hamilton Abreu"
		]
	},
	"readinglists-desc": "Permite que os utilizadores mantenham listas privadas de artigos, tais como listas de marcadores de páginas ou listas \"Para Ler Mais Tarde\".",
	"readinglists-db-error-not-set-up": "Não foram criadas listas de leitura para este utilizador.",
	"readinglists-db-error-already-set-up": "Já foram criadas listas de leitura para este utilizador.",
	"readinglists-db-error-cannot-delete-default-list": "A lista por omissão não pode ser eliminada.",
	"readinglists-db-error-cannot-update-default-list": "A lista por omissão não pode ser atualizada.",
	"readinglists-db-error-no-such-list": "A lista $1 não existe.",
	"readinglists-db-error-no-such-list-entry": "Não existe uma entrada $1 na lista.",
	"readinglists-db-error-not-own-list": "A lista $1 pertence a outro utilizador.",
	"readinglists-db-error-not-own-list-entry": "A entrada $1 da lista pertence a outro utilizador.",
	"readinglists-db-error-list-deleted": "A lista $1 foi eliminada.",
	"readinglists-db-error-list-entry-deleted": "A entrada $1 da lista foi eliminada.",
	"readinglists-db-error-duplicate-page": "A lista já contém esta página.",
	"readinglists-db-error-empty-list-ids": "O parâmetro de identificadores de listas não pode estar vazio.",
	"readinglists-db-error-user-required": "Este método não pode ser chamado sem especificar o utilizador.",
	"readinglists-db-error-list-limit": "Os utilizadores não podem ter mais do que $1 {{PLURAL:$1|lista|listas}}.",
	"readinglists-db-error-entry-limit": "A lista $1 não pode ter mais do que $2 {{PLURAL:$2|entrada|entradas}}.",
	"readinglists-db-error-too-long": "O valor do campo $1 não pode ter mais do que $2 bytes.",
	"readinglists-db-error-no-such-project": "'$1' não é um projeto conhecido.",
	"readinglists-apierror-project-title-param": "<var>$1project</var> e <var>$1title</var> têm de ser usados em conjunto.",
	"readinglists-apierror-too-old": "As datas e horas passadas a <var>$1changedsince</var> não podem ser anteriores a <kbd>$2</kbd>.",
	"readinglists-apierror-invalidsort-notbyname": "A opção de ordenação <kbd>name</kbd> não pode ser usada em conjunto com <var>$1changedsince</var>.",
	"apierror-readinglists-batch-invalid-json": "JSON inválido para o parâmetro <var>batch</var> (grupo): $1",
	"apierror-readinglists-batch-invalid-structure": "JSON inválido para o parâmetro <var>batch</var> (grupo): tem de conter uma matriz de objetos que tenham valores escalares.",
	"apierror-readinglists-batch-missingparam-at-least-one-of": "Em todos os objetos dentro da entrada <var>batch</var> (grupo), {{PLURAL:$2|o campo|pelo menos um dos seguintes campos}} $1 é obrigatório.",
	"apihelp-query+readinglists-summary": "Listar ou filtrar as listas de leitura do utilizador e mostrar metadados sobre elas.",
	"apihelp-query+readinglists-extended-description": "Este módulo tem três modos de operação. Com o parâmetro <var>$1changedsince</var> (alteradas desde), ele devolve todas as listas do utilizador corrente alteradas após a data fornecida. (Este modo destina-se à sincronização de dispositivos e, ao contrário dos restantes, inclui listas eliminadas. Só são consideradas as alterações aos metadados das listas, não às entradas das listas.) Com os parâmetros <var>$1project</var> (projeto) e <var>$1title</var> (título), ele devolve todas as listas que incluem essa página. Sem nenhum destes parâmetros, devolve todas as listas.",
	"apihelp-query+readinglists-param-changedsince": "Mostrar as listas que foram alteradas após esta data e hora. Tem se ser posterior a <kbd>$1</kbd>.",
	"apihelp-query+readinglists-param-project": "Projeto da página a filtrar. Tem de ser usado em conjunto com <var>$1title</var>.",
	"apihelp-query+readinglists-param-title": "Título da página a filtrar. Tem de ser usado em conjunto com <var>$1project</var>.",
	"apihelp-query+readinglists-param-sort": "Propriedade pela qual ordenar. Ignorado quando <var>$1project</var> e <var>$1title</var> está definido (resultados são devolvidos pela ordem na BD). Por omissão, é <kbd>updated</kbd> quando <var>$1changedsince</var> está definido, e <kbd>name</kbd> quando não está.",
	"apihelp-query+readinglists-paramvalue-sort-name": "Nome da lista (o ordenamento é por valor binário; por exemplo, qualquer carácter ASCII maiúsculo será listado antes de qualquer minúsculo).",
	"apihelp-query+readinglists-paramvalue-sort-updated": "Data e hora da última atualização (nas atualizações incluem-se mudanças aos metadados da lista mas não se incluem mudanças aos elementos da lista).",
	"apihelp-query+readinglists-param-dir": "Direção de ordenação: <kbd>ascending</kbd> (ascendente, de A a Z, do mais antigo ao mais recente) ou <kbd>descending</kbd> (descendente). Ignorado quando <var>$1project</var> e <var>$1title</var> estão definidos.",
	"apihelp-query+readinglists-param-limit": "O número de resultados a serem devolvidos.",
	"apihelp-query+readinglists-example-1": "Obter as listas de leitura do utilizador corrente.",
	"apihelp-query+readinglists-example-2": "Obter as listas de leitura do utilizador corrente que tenham sido alteradas após <kbd>2013-01-01T00:00:00Z</kbd>.",
	"apihelp-query+readinglists-example-3": "Obter as listas de leitura do utilizador corrente que contenham a página <kbd>Dog</kbd> do projeto <kbd>en.wikipedia.org</kbd>",
	"apihelp-query+readinglistentries-summary": "Listar as páginas de uma certa lista.",
	"apihelp-query+readinglistentries-extended-description": "Este módulo tem dois modos de operação. Com o parâmetro <var>$1lists</var>, devolve as páginas nas listas especificadas. Com o parâmetro <var>$1changedsince</var>, devolve todas as entradas de todas as listas do utilizador corrente que tenham sido alteradas após a data fornecida. (Este modo destina-se à sincronização de dispositivos e, ao contrário dos restantes modos inclui entradas eliminadas, mas não inclui entradas de listas eliminadas).",
	"apihelp-query+readinglistentries-param-lists": "Os identificadores das listas das quais serão devolvidas páginas.",
	"apihelp-query+readinglistentries-param-changedsince": "Mostrar as entradas de lista que foram alteradas após esta data e hora. Tem se ser posterior a <kbd>$1</kbd>.",
	"apihelp-query+readinglistentries-param-sort": "Propriedade pela qual ordenar. <kbd>name</kbd> não pode ser usada em conjunto com <var>$1changedsince</var>. O valor por omissão é <kbd>updated</kbd> se <var>$1changedsince</var> estiver definido e <kbd>name</kbd> se não.",
	"apihelp-query+readinglistentries-paramvalue-sort-name": "Título do artigo (O nome do projeto é ignorado. A ordenação é por valor binário; por exemplo, qualquer carácter ASCII maiúsculo será listado antes de qualquer minúsculo).",
	"apihelp-query+readinglistentries-paramvalue-sort-updated": "Data e hora da última atualização.",
	"apihelp-query+readinglistentries-param-dir": "Direção de ordenação: <kbd>ascending</kbd> (ascendente, de A a Z, do mais antigo ao mais recente) ou <kbd>descending</kbd> (descendente).",
	"apihelp-query+readinglistentries-param-limit": "O número de resultados a serem devolvidos.",
	"apihelp-query+readinglistentries-example-1": "Obter as páginas das listas de leitura com os identificadores <kbd>10</kbd>, <kbd>11</kbd> e <kbd>12</kbd>.",
	"apihelp-query+readinglistentries-example-2": "Obter as entradas de lista do utilizador corrente que tenham sido alteradas após <kbd>2013-01-01T00:00:00Z</kbd>.",
	"apihelp-readinglists-summary": "Operações de escrita das listas de leitura.",
	"apihelp-readinglists-param-command": "Comando (submódulo da API) para operações de escrita das listas de leitura.",
	"apihelp-readinglists-extended-description": "Criar, atualizar, eliminar ou ordenar listas de leitura e entradas dessas listas. Consulte a documentação dos vários comandos para mais detalhes.",
	"apihelp-readinglists+setup-summary": "Ativar as listas para o utilizador corrente.",
	"apihelp-readinglists+setup-extended-description": "Este comando tem de ser utilizado antes de o utilizador fazer o que quer que seja com listas de leitura.Também cria uma lista por omissão. Para desfazê-lo, use <kbd>[[Special:ApiHelp/readinglists+teardown|desmantelar]]</kbd>.",
	"apihelp-readinglists+setup-example-1": "Instalar listas de leitura para o utilizador corrente.",
	"apihelp-readinglists+teardown-summary": "Desativar listas para o utilizador corrente.",
	"apihelp-readinglists+teardown-extended-description": "Remove todos os dados das listas de leitura do utilizador. O comando <kbd>[[Special:ApiHelp/readinglists+setup|setup]]</kbd> (instalar) tem de ser usado se o utilizador pretende voltar a usar as listas de leitura.",
	"apihelp-readinglists+teardown-example-1": "Desativar as listas de leitura para o utilizador corrente.",
	"apihelp-readinglists+create-summary": "Criar uma lista nova para o utilizador corrente.",
	"apihelp-readinglists+create-extended-description": "O utilizador tem de ter menos do que $1 {{PLURAL:$1|lista (não eliminada)|listas (não eliminadas)}}.",
	"apihelp-readinglists+create-param-name": "Nome da lista. Obrigatório, a menos que esteja a ser usada a criação em grupo.",
	"apihelp-readinglists+create-param-description": "Descrição da lista.",
	"apihelp-readinglists+create-param-batch": "Dados agrupados para criar mais do que uma lista num único pedido, na forma de uma matriz JSON com um ou mais objetos com campos <var>name</var> (nome) e (opcionalmente) <var>description</var> (descrição).",
	"apihelp-readinglists+create-example-1": "Criar uma lista de leitura nova.",
	"apihelp-readinglists+create-example-2": "Criar várias listas novas.",
	"apihelp-readinglists+update-summary": "Atualizar uma lista que pertence ao utilizador corrente.",
	"apihelp-readinglists+update-param-list": "Identificador da lista. Obrigatório, a menos que esteja a ser usada a criação em grupo.",
	"apihelp-readinglists+update-param-name": "Novo nome da lista. Este campo, ou o campo description, são obrigatórios a menos que esteja a ser feita uma atualização em grupo.",
	"apihelp-readinglists+update-param-description": "Nova descrição da lista.",
	"apihelp-readinglists+update-param-batch": "Dados agrupados para criar mais do que uma lista num único pedido, na forma de uma matriz JSON com um ou mais objetos com campos <var>list</var> (lista), <var>name</var> (nome) e <var>description</var> (descrição).",
	"apihelp-readinglists+update-example-1": "Mudar o nome da lista de leitura com o identificador <kbd>42</kbd>.",
	"apihelp-readinglists+update-example-2": "Atualizar várias listas.",
	"apihelp-readinglists+delete-summary": "Eliminar uma lista que pertence ao utilizador corrente.",
	"apihelp-readinglists+delete-extended-description": "As listas eliminadas permanecem disponíveis durante algum tempo através dos módulos <kbd>[[Special:ApiHelp/query+readinglists|readinglists]]</kbd> (listas de leitura) e <kbd>[[Special:ApiHelp/query+readinglistentries|readinglistentries]]</kbd> (entradas de listas de leitura), via o parâmetro <var>$1changedsince</var>. Não há forma de restaurá-las.",
	"apihelp-readinglists+delete-param-list": "Identificador de lista. Obrigatório, a menos que esteja a ser feita uma eliminação em grupo.",
	"apihelp-readinglists+delete-param-batch": "Dados agrupados para eliminar mais do que uma lista num único pedido, na forma de uma matriz JSON com um ou mais objetos com um campo <var>list</var>.",
	"apihelp-readinglists+delete-example-1": "Eliminar a lista de leitura com o identificador <kbd>11</kbd>.",
	"apihelp-readinglists+delete-example-2": "Eliminar várias listas.",
	"apihelp-readinglists+createentry-summary": "Adicionar uma página nova a uma lista que pertence ao utilizador corrente.",
	"apihelp-readinglists+createentry-extended-description": "As entradas de listas têm de ser únicas. As páginas não estão limitadas à wiki na qual a API é acedida. O utilizador tem de ter menos do que $1 {{PLURAL:$1|entrada (não eliminada)|entradas (não eliminadas)}} na lista.",
	"apihelp-readinglists+createentry-param-list": "Identificador de lista.",
	"apihelp-readinglists+createentry-param-project": "Nome de projeto da wiki que aloja a página (tipicamente, é o nome de domínio da wiki). Obrigatório, a menos que esteja a ser feita uma criação em grupo.",
	"apihelp-readinglists+createentry-param-title": "Título da página (incluindo o nome localizado do espaço nominal). Obrigatório, a menos que esteja a ser feita uma criação em grupo. É recomendado um formato legível pelos utilizadores (usando espaços, não sublinhados). A API trata os títulos como texto em bruto; normalizações (como a letra inicial maiúscula) são deixadas aos clientes.",
	"apihelp-readinglists+createentry-param-batch": "Dados agrupados para criar mais do que uma entrada de lista (na mesma lista) num único pedido, na forma de uma matriz JSON com um ou mais objetos com campos <var>project</var> (projeto) e <var>title</var> (título).",
	"apihelp-readinglists+createentry-example-1": "Adicionar a página <kbd>Dog</kbd> do projeto <kbd>en.wikipedia.org</bar> à lista que tem o identificador <kbd>33</kbd>.",
	"apihelp-readinglists+createentry-example-2": "Adicionar várias páginas a uma lista.",
	"apihelp-readinglists+deleteentry-summary": "Eliminar uma página de uma lista que pertence ao utilizador corrente.",
	"apihelp-readinglists+deleteentry-param-entry": "Identificador de entrada. Obrigatório, a menos que esteja a ser feita uma eliminação em grupo.",
	"apihelp-readinglists+deleteentry-param-batch": "Dados agrupados para eliminar mais do que uma entrada de lista num único pedido, na forma de uma matriz JSON com um ou mais objetos com um campo <var>entry</var> (entrada).",
	"apihelp-readinglists+deleteentry-example-1": "Eliminar a entrada de lista que tem o identificador <kbd>8</kbd>.",
	"apihelp-readinglists+deleteentry-example-2": "Eliminar várias entradas de lista."
}
