{
	"@metadata": {
		"authors": [
			"Liuxinyu970226",
			"Raymond",
			"Robby",
			"Tacsipacsi",
			"Tgr",
			"Umherirrender"
		]
	},
	"readinglists-desc": "{{desc|name=ReadingLists|url=https://www.mediawiki.org/wiki/Extension:ReadingLists}}",
	"readinglists-db-error-not-set-up": "Error message used when trying to perform an operation for a user without calling setup first.",
	"readinglists-db-error-already-set-up": "Error message used when trying to call setup for a user when it has already been performed.",
	"readinglists-db-error-cannot-delete-default-list": "Error message used when trying to delete the default list.",
	"readinglists-db-error-cannot-update-default-list": "Error message used when trying to update the default list.",
	"readinglists-db-error-no-such-list": "Error message used when trying to do something with a non-existent list.",
	"readinglists-db-error-no-such-list-entry": "Error message used when trying to do something with a non-existent list entry.",
	"readinglists-db-error-not-own-list": "Error message used when trying to do something with a list that belongs to another user.",
	"readinglists-db-error-not-own-list-entry": "Error message used when trying to do something with a list entry that belongs to another user.",
	"readinglists-db-error-list-deleted": "Error message used when trying to do something with a list that has been deleted.",
	"readinglists-db-error-list-entry-deleted": "Error message used when trying to do something with a list entry that has been deleted.",
	"readinglists-db-error-duplicate-list": "Error message used when trying to update a list with a name that's already in use.",
	"readinglists-db-error-duplicate-page": "Error message used when trying to add a page to a list that already contains it.",
	"readinglists-db-error-empty-list-ids": "Error message used when querying list entries without specifying any lists.",
	"readinglists-db-error-user-required": "Error message used when calling a method that operates on a single user, but the user was not specified when the repository object was constructed.",
	"readinglists-db-error-list-limit": "Error message used when the user has as many or more lists than the maximum allowed, and tries to add another one.\n\nParameters:\n* $1 - the maximum allowed number of lists per user.",
	"readinglists-db-error-entry-limit": "Error message used when the user has as many or more entries in the given list than the maximum allowed, and tries to add another one.\n\nParameters:\n* $1 - the ID of the list in question.\n$2 - the maximum allowed number of entries per list.",
	"readinglists-db-error-too-long": "Error message used when the user tries to set list/entry string fields to a longer value than what the database schema allows.\n\nParameters:\n* $1 - DB field name.\n* $2 - DB field maximum length (in bytes).",
	"readinglists-db-error-no-such-project": "Error message used when the user tries to add a new list entry, but the project does not match any of the known ones.\n\nParameters:\n* $1 - the project.",
	"readinglists-browser-add-entry-success": "Message displayed when the user adds a page to a reading list.\n\nParameters:\n* $1 - The page title.",
	"readinglists-browser-login-prompt": "Message prompting the user to log in to save pages to a reading list.",
	"readinglists-browser-error-intro": "Message indicating that an error has occurred\n\nParameters:\n* $1 - The error message from the server.",
	"readinglists-browser-enable-sync-prompt": "Message prompting the user to enable reading list syncing in the Wikipedia mobile app.",
	"readinglists-browser-extension-info-link-text": "Text for a link where the user can learn about the reading lists browser extension\n{{Identical|Learn more}}",
	"readinglists-browser-list-entry-limit-exceeded": "Message informing the user that a page cannot be added to a list because the list has reached its maximum number of entries.\n\nParameters:\n* $1 - The maximum number of entries per list.",
	"readinglists-browser-extension-product-title": "Name of the browser extension for adding wiki pages to a reading list",
	"readinglists-browser-page-not-supported": "Tooltip shown when the user hovers over the browser extension's toolbar icon on an unsupported page.\n\nParameters:\n* $1 - The extension name.",
	"readinglists-special-title": "Title of special page that shows reading lists",
	"readinglists-description": "Summary of page that shows all your reading lists",
	"readinglists-loading": "Message while reading lists load",
	"reading-list-purpose": "Prompt telling user why they should login.",
	"readinglists-error": "Error shown to older browsers.",
	"readinglists-import-error": "Error that shows when you try to import bad data.",
	"readinglists-import-size-error": "Error that shows on large lists.",
	"special-tab-readinglists-short": "Tab that shows on special page to take you back to your lists",
	"readinglists-default-title": "Title for the default list.",
	"readinglists-default-description": "Description for the default list.",
	"action-action-readinglist-private": "Security error when you try and access someone's user list",
	"readinglists-empty-message": "Message that shows when you have zero lists.",
	"readinglists-list-empty-message": "Message that shows on a list with no pages in it.",
	"readinglists-no-title": "Name of a list without a name",
	"readinglists-export": "Share button label",
	"readinglists-import-app": "{{notranslate}}. Configured on site basis. See [[Extension:WikimediaMessages]] for Wikimedia localizations.",
	"readinglists-import-app-misconfigured": "Shows when something is setup incorrectly and the import URL is followed.",
	"readinglists-import-disclaimer": "Explains how the list was generated.",
	"readinglists-import-button-label": "Button label for importing the current list.\n{{identical|Import}}",
	"readinglists-import-button-hint": "Hint shown above the button for importing the current list.",
	"readinglists-import-app-launch-hint": "Hint shown when attempting to import a list without the app installed."
}
